<?php
// Код должен вывести длину массива:
	$arr = [1, 2, 3, 4, 5];
	//echo count($arr);

// Код должен вывести последний элемент массива
    $arr1 = [1, 2, 3, 4, 5];
//	echo $arr[count($arr1) - 1];

// код должен вывести сумму элементов массива
    $arr2 = [1, 2, 3, 4, 5];
	//echo array_sum($arr2)


    // Код должен найти сумму элементов массива

    $arr3 = [
		'a' => 1,
		'b' => 2,
		'c' => 3,
	];
	
	//echo $arr3['a'] + $arr3['b'] + $arr3['c'];


    // Код должен вывести элемент массива по ключу, заданному в переменной:

    $arr4 = [
		'a' => 1,
		'b' => 2,
		'c' => 3,
	];
	
	$k = 'a';
	echo $arr4[$k]

?>